Revit 2018 API
OverrideGraphicSettings.ProjectionFillPatternId Property
 ElementId of the projection surface fill pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2014
Syntax
C#
public ElementId ProjectionFillPatternId { get; }
Visual Basic
Public ReadOnly Property ProjectionFillPatternId As ElementId
	Get
Visual C++
public:
property ElementId^ ProjectionFillPatternId {
	ElementId^ get ();
}
See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace